"""
                                        Заняття 2: Docker


                        Docker

Наступний рівень створення віртуальних середовищ — це зімітувати всю операційну систему, скористатися "віртуальною
машиною" для запуску вашого застосунку. Так ви зможете бути впевненими на 100%, що жодні сторонні залежності системного
рівня не втрутяться в роботу вашого застосунку. Звичайно, ви можете використовувати повноцінні віртуальні машини на
зразок VirtualBox або аналоги для цього. Але є зручніше, а головне економічне рішення — це Docker.

Docker – це платформа, яка дозволяє «створювати, постачати та запускати будь-який застосунок всюди». За неймовірно
короткий час вона пройшла великий шлях і тепер вважається стандартним способом вирішення одного з найдорожчих аспектів
програмного забезпечення – розгортання.

Docker дозволяє запустити віртуальну машину за мінімальних накладних витрат. Практично ви нічого не втрачаєте,
запускаючи застосунок в Docker, навантаження на процесор або пам'ять залишається на тому ж рівні, що й при використанні
рішень без віртуалізації. Але сам застосунок працює на "окремій" контрольованій ізольованій операційній системі зі
своїми застосунками, налаштуваннями та іншим.

                        Контейнери

​Контейнери докорінно змінюють спосіб розробки, розповсюдження та функціонування програмного забезпечення. Розробники 
можуть створювати програмне забезпечення на локальній системі, точно знаючи, що воно працюватиме однаково у 
будь-якому операційному середовищі. Контейнери (containers) – це засоби інкапсуляції застосунку разом з його 
залежностями.

В основу Docker було закладено існуючу технологію Linux-контейнерів з різноманітними обгортками та розширеннями – 
здебільшого, використовуючи образи, що переносяться, та зручний для користувача інтерфейс – для створення повністю 
готового до застосування рішення, що забезпечує створення та розповсюдження контейнерів.

Платформа Docker складається із двох окремих компонентів: Docker Engine — механізму, що відповідає за створення та 
функціонування контейнерів, та Docker Hub — хмарного сервісу для розповсюдження контейнерів(такий собі аналог GitHub).

На перший погляд контейнери можуть здатися лише спрощеною формою віртуальних машин, але, незважаючи на те, що 
контейнери та віртуальні машини на перший погляд здаються схожими, між ними існують важливі відмінності, які 
простіше всього продемонструвати на графічних схемах.

Три віртуальні машини, що працюють на одному хості

Три контейнери, що працюють на одному хості

На відміну від віртуальних машин, ядро хоста (Host OS) спільно використовується (розділяється) працюючими 
контейнерами. Це означає, що контейнери завжди обмежуються використанням того самого ядра, яке функціонує на хості.





"""