"""
                                        Заняття 2: Docker


                        Docker

Наступний рівень створення віртуальних середовищ — це зімітувати всю операційну систему, скористатися "віртуальною
машиною" для запуску вашого застосунку. Так ви зможете бути впевненими на 100%, що жодні сторонні залежності системного
рівня не втрутяться в роботу вашого застосунку. Звичайно, ви можете використовувати повноцінні віртуальні машини на
зразок VirtualBox або аналоги для цього. Але є зручніше, а головне економічне рішення — це Docker.

Docker – це платформа, яка дозволяє «створювати, постачати та запускати будь-який застосунок всюди». За неймовірно
короткий час вона пройшла великий шлях і тепер вважається стандартним способом вирішення одного з найдорожчих аспектів
програмного забезпечення – розгортання.

Docker дозволяє запустити віртуальну машину за мінімальних накладних витрат. Практично ви нічого не втрачаєте,
запускаючи застосунок в Docker, навантаження на процесор або пам'ять залишається на тому ж рівні, що й при використанні
рішень без віртуалізації. Але сам застосунок працює на "окремій" контрольованій ізольованій операційній системі зі
своїми застосунками, налаштуваннями та іншим.

                        Контейнери

​Контейнери докорінно змінюють спосіб розробки, розповсюдження та функціонування програмного забезпечення. Розробники 
можуть створювати програмне забезпечення на локальній системі, точно знаючи, що воно працюватиме однаково у 
будь-якому операційному середовищі. Контейнери (containers) – це засоби інкапсуляції застосунку разом з його 
залежностями.

В основу Docker було закладено існуючу технологію Linux-контейнерів з різноманітними обгортками та розширеннями – 
здебільшого, використовуючи образи, що переносяться, та зручний для користувача інтерфейс – для створення повністю 
готового до застосування рішення, що забезпечує створення та розповсюдження контейнерів.

Платформа Docker складається із двох окремих компонентів: Docker Engine — механізму, що відповідає за створення та 
функціонування контейнерів, та Docker Hub — хмарного сервісу для розповсюдження контейнерів(такий собі аналог GitHub).

На перший погляд контейнери можуть здатися лише спрощеною формою віртуальних машин, але, незважаючи на те, що 
контейнери та віртуальні машини на перший погляд здаються схожими, між ними існують важливі відмінності, які 
простіше всього продемонструвати на графічних схемах.

Три віртуальні машини, що працюють на одному хості

Три контейнери, що працюють на одному хості

На відміну від віртуальних машин, ядро хоста (Host OS) спільно використовується (розділяється) працюючими 
контейнерами. Це означає, що контейнери завжди обмежуються використанням того самого ядра, яке функціонує на хості.


                        Встановлення

​Докер постачається у вигляді Community Edition (CE) та Enterprise Edition (EE), ми будемо використовувати CE. На 
головній сторінці доступні посилання для завантаження Docker Desktop під усі популярні платформи. Виберіть вашу та 
встановіть Докер. (https://www.docker.com/products/docker-desktop/) 

Щоб переконатися в правильності встановлення та працездатності програмного середовища Docker, варто виконати команду 
docker version. Ця команда повинна видати інформацію, схожу на наведену нижче:

        Client: Docker Engine - Community
        Cloud integration: 1.0.12
        Version:           20.10.5
        API version:       1.41
        Go version:        go1.13.15
        Git commit:        55c4c88
        Built:             Tue Mar  2 20:14:53 2021
        OS/Arch:           windows/amd64
        Context:           default
        Experimental:      true

        Server: Docker Engine - Community
        Engine:
        Version:          20.10.5
        API version:      1.41 (minimum version 1.12)
        Go version:       go1.13.15
        Git commit:       363e9a8
        Built:            Tue Mar  2 20:15:47 2021
        OS/Arch:          linux/amd64
        Experimental:     false
        containerd:
        Version:          1.4.4
        GitCommit:        05f951a3781f4f2c1911b05e61c160e9c30eaa8e
        runc:
        Version:          1.0.0-rc93
        GitCommit:        12644e614e25b05da6fd08a38ffa0cfe1903fdec
        docker-init:
        Version:          0.19.0
        GitCommit:        de40ad0


                        Навіщо потрібен Docker

​Головна причина — Docker заощаджує бізнесу багато грошей. Але перерахуємо все ж таки докладніше основні причини 
використання:

            - Заміна віртуальних машин
            - Прототипування програмного забезпечення
            - Упаковка програмного забезпечення
            - Можливість для архітектури мікросервісів
            - Моделювання мереж
            - Можливість продуктивності повного стеку в автономному режимі
            - Скорочення неминучих витрат на відлагодження
            - Документування залежностей програмного забезпечення
            - Можливість безперервної доставки


                        Архітектура та компоненти Docker

​У Docker використовується архітектура клієнт/сервер, відповідно до якої клієнт взаємодіє з демоном Docker, а той 
надає всі необхідні клієнту послуги.

Розглянемо компоненти, що складають екосистему Docker:

        - сервер або демон Docker. Виконується в хост-системі та керує всіма запущеними контейнерами;
        - контейнер Docker. Автономна віртуальна система, що містить процес, що виконується, всі файли, залежності, 
        адресний простір процесу та мережеві порти, необхідні застосунку. Оскільки кожен контейнер має свій простір 
        портів, варто організувати їх відображення у фактичні порти на рівні Docker;
        - клієнт Docker. Інтерфейс користувача або командний рядок для взаємодії з демоном Docker;
        - образи Docker. Шаблонні файли, доступні лише для читання, із контейнером Docker. Їх можна переміщати та 
        передавати. На відміну від віртуальних машин, ці файли можна зберігати в системі управління версіями;
        - реєстр Docker. Репозиторій для зберігання та розповсюдження образів контейнерів Docker. Приклад Docker Hub 
        (аналог GitHub), куди можна поміщати та звідки можна витягувати образи. Організації можуть організувати свій 
        реєстр;
        - файл Dockerfile. Це дуже простий текстовий файл, що містить команди, які виконують збирання образів Docker;
        - Docker Machine. Встановлює та конфігурує Docker-хости на локальних та віддалених ресурсах. Крім того, 
        Machine конфігурує клієнта Docker, спрощуючи процедуру перемикання між середовищами. За найсвіжішою 
        інформацією з цієї теми звертайтесь до офіційної онлайн-документації Docker;
        - Docker Swarm. По суті, це готовий до використання механізм кластеризації, що дозволяє об'єднати кілька 
        вузлів Docker в один великий хост Docker.
        - Docker Compose. Інструмент для створення та виконання застосунків, скомпонованих з кількох Docker-контейнерів. 
        Такі компонування використовуються головним чином при розробці та тестуванні, але набагато рідше у 
        виробничому середовищі.

"""