"""                                  Заняття 1: Development Tools



                        Менеджер пакетів та віртуальних середовищ pipenv

Pipenv — це сучасний інструмент для управління робочим середовищем у Python.

Основні можливості pipenv:
    - Створення та управління віртуальним середовищем.
    - Синхронізація пакетів у Pipfile під час встановлення та видалення пакетів.
    - Автоматичне підвантаження змінних середовища з файлу .env.

Коли на одному комп'ютері накопичується кілька віртуальних середовищ для різних проектів, над якими ведеться робота, 
неминуче виникає проблема управління набором віртуальних середовищ, підтримки в актуальному і робочому стані, 
видалення непотрібних для звільнення місця тощо. Ці завдання вирішує Pipenv за рахунок створення одного місця (папки) 
для зберігання всіх віртуальних середовищ, з якими ви працюєте.

Управління залежностями, коли ваш застосунок може перестати працювати через конфлікт версій встановлених бібліотек, 
— це одна з головних проблем розробників Python.

Використовувати requirements.txt, звичайно, можна, але вимагає додаткових зусиль для підтримки актуальних версій 
пакетів. Оновлення пакетів до нових версій може стати справжньою проблемою для застосунків, де багато залежностей.

Pipenv частково вирішує цю проблему, рекурсивно перевіряючи наявність конфліктів залежностей усіх пакетів і 
намагаючись встановити останні версії пакетів, які не викликають конфліктів.

Для розгортання застосунків на клієнтських комп'ютерах або серверах потрібно мати набір інструкцій для розгортання 
середовища, про яке ми знаємо, що воно працює. Зазвичай таке середовище — це середовище комп'ютера розробника, у 
якому ведеться розробка. Щоб повторити середовище на іншому комп'ютері, потрібно встановити ті самі версії бібліотек, 
Python і всі залежності. Це найпростіший та найінтуїтивніший спосіб уникнути конфлікту версій встановлених бібліотек. 
Pipenv вирішує цю проблему, генеруючи файл з точними версіями всіх бібліотек віртуального середовища та даючи 
можливість встановити з цього файлу "зліпок" працюючої системи.

Зараз Pipenv є фактично стандартом для розробників і вміти з ним працювати — просто необхідно.


                        Встановлення Pipenv

​Pipenv є пакетом Python, так само, як і pip, але не входить у стандартне постачання Python, і його потрібно 
встановлювати. Встановити можна за допомогою pip команди:

            pip install pipenv --user


                        Робота з віртуальними середовищем Pipenv

​Для створення середовища читає ім'я папки, в якій працює і увесь шлях до неї. Всі віртуальні середовища зберігаються 
в одному місці (залежить від ОС) і Pipenv автоматично створює нове середовище або використовує створене, залежно від 
папки, де ви працюєте.

Коли потрібно явно вказати, що ви працюєте в проекті, і потрібно створити для проекту середовище з конкретною 
версією Python, можна виконати команду:
            
            pipenv --python 3.7

Цією командою ми вказуємо, що у цьому проекті потрібно створити віртуальне середовище з Python версією 3.7.

Під капотом Pipenv використовує venv для створення віртуальних середовищ. Тому ви можете використовувати створене 
віртуальне середовище і без pipenv, якщо потрібно.

Якщо потрібно видалити середовище, можна скористатися командою:

            pipenv --rm
            
            
                        Встановлення нових пакетів

Для встановлення пакетів, використовуючи pipenv, можна виконати команду:

            pipenv install Flask

Ця команда встановить найновішу версію Flask. Якщо потрібно встановити якусь конкретну версію:

            pipenv install Flask==0.6.1

Ця команда встановить Flask версії 0.6.1.
Зверніть увагу, що під час роботи pipenv створює два файли: Pipfile та Pipfile.lock.

Pipfile містить інформацію про те, звідки та яку версію пакета потрібно встановити. Pipfile.lock ж зберігає 
інформацію про всі (включаючи залежність) встановлені пакети в середовищі.

Для встановлення пакетів pipenv зчитує хеш пакета та записує його у спеціальний файл Pipfile.lock разом із версією 
пакета. Це робиться для того, щоб бути на 100% впевненим, що версія пакета, яку ви використовуєте, точно відповідає, 
якщо зміниться хоча б один біт, це не залишиться непоміченим.

Через це встановлення пакетів займає більше часу, ніж просто використання pip. Крім того, pipenv автоматично 
перевіряє всі залежності пакетів, що встановлюються, і намагається автоматично встановити найновішу сумісну версію 
всіх пакетів. Це дає вам можливість розробляти програму, використовуючи найновіші пакети без додаткових зусиль.

Буває, що для розробки вам потрібно встановити пакет, який не входить у фінальне постачання, але потрібний для 
розробки, наприклад iPython.

Спеціально для такої ситуації pipenv дає можливість встановлювати пакети в середовищі, вказавши, що вони не повинні 
входити до фінального постачання:

            pipenv install ipython --dev

Ця команда встановить пакет iPython, але відмітить його та всі його залежності як необов'язкові, і їх можна буде не 
встановлювати на цільовому пристрої.            


                        Розгортання віртуального середовища

​Коли ви вже маєте Pipfile та Pipfile.lock і вам потрібно встановити всі пакети у нове (чисте) віртуальне середовище, 
ви можете виконати:

    - pipenv install — для встановлення найновіших версій пакетів з Pipfile в середовище з можливим оновленням 
    Pipfile.lock (якщо вийшли нові версії пакетів, ніж зазначені в Pipfile.lock).
    - pipenv install --dev — те саме, але встановляться також пакети, відмічені як --dev, для розробки.
    - pipenv sync встановить суворо вказані в Pipfile.lock версії пакетів і не перевірятиме наявність новіших версій.
    - pipenv install --deploy встановить версії точно такі, як зазначено в Pipfile.lock і, якщо хеші пакетів не 
    збігаються з хешами з Pipfile.lock, або версія Python не збігається, видасть помилку та припинить встановлення.
    - pipenv install --system — те саме, що й pipenv install, але встановить пакети глобально у систему, а не у 
    віртуальне середовище.            


                        Видалення та оновлення пакетів

​Для видалення пакета з середовища та всіх його залежностей ви можете виконати pipenv uninstall package_name. pipenv 
вміє стежити за залежностями та, на відміну від pip, може виконати видалення, не залишаючи за собою "сміття" пакетів, 
які встановлювалися як залежності, але більше не потрібні.

Для оновлення всіх пакетів на найсвіжіші версії ви можете виконати pipenv update.

Під час встановлення або оновлення пакетів можуть виникати ті самі конфлікти версій різних пакетів залежностей. 
Наприклад, пакет A вимагає встановити botocore версії не вище 0.6.1, водночас boto3 вимагає, щоб botocore був не 
старшим 1.0.0. Це проблема, яку стандартними засобами Python не вирішити.

pipenv може вивести вам список всіх пакетів та їх залежностей, що, звичайно, допоможе усунути конфлікти залежностей. 
Для цього потрібно виконати pipenv graph.

Окремо варто згадати, що якщо ви встановлювали пакети в середовище pipenv за допомогою pip і потрібно видалити все 
зайве, ви можете виконати pipenv clean і все, що не вказано у Pipfile.lock, буде видалено.



                        Менеджер Poetry

Poetry - це інструмент для управління залежностями у Python проектах (аналог вбудованого pip). Він схожий за 
функціоналом на розглянутий раніше pipenv.

Poetry дозволяє ефективно управляти залежностями та пакетами в Python. Він виконує ту саму роль, що й setup.py або 
pipenv, але має більшу гнучкість і функціональність. Ви можете оголосити бібліотеки, від яких залежить ваш проект, 
у файлі pyproject.toml. Після цього poetry встановлюватиме або оновлюватиме їх за вашою вимогою. Крім того, цей 
інструмент дозволяє інкапсулювати робочий проект в ізольоване середовище. Нарешті, ви можете використати poetry для 
прямої публікації вашого пакету на Pypi.

Використання файлів pypoproject.toml та poetry.lock робить його схожим на Node Package Manager (npm) для Node.js.


                        Встановлення poetry

​Встановити poetry можна через Windows (Powershell)
(Invoke-WebRequest -Uri https://install.python-poetry.org -UseBasicParsing).Content | py -

Poetry можна встановити вручну за допомогою pip та модуля venv. Діючи таким чином, ви, по суті, виконаєте кроки, які 
виконує офіційний встановлювач.
    python3 -m venv $VENV_PATH
    $VENV_PATH/bin/pip install -U pip setuptools
    $VENV_PATH/bin/pip install poetry

Poetry буде доступний за адресою $VENV_PATH/bin/poetry і може бути викликаний напряму або за символічним посиланням 
в іншому місці. Щоб видалити Poetry, просто видаліть весь каталог $VENV_PATH.


                        Створення нового проекту

​Після встановлення ми можемо створювати "poetry-проекти" за допомогою команди poetry new <ім'я проекту>.

Припустимо, що ми ввели команду poetry new solution, тоді ми отримаємо наступну структуру каталогів:

├── solution
│   └── __init__.py
├── pyproject.toml
├── README.rst
└── tests
    ├── __init__.py
    └── test_solution.py

Ми бачимо, що у проекті solution був створений однойменний пакет - директорія solution з відповідним __init__.py. 
Будь-який poetry-проект завжди містить хоча б один пакет.

Окрім пакету solution, у проекті вже є пакет tests з першим тестом і ми повинні розуміти, що справжні проекти завжди 
мають тести.

У файлі README.rst повинен бути опис проекту. Це файл формату reStructuredText.

Як бачимо Poetry автоматично створив усі необхідні файли для майбутнього пакета, але найбільший інтерес представляє
файл під назвою pyproject.toml, цей файл - просунута альтернатива requirements.txt.

Вміст файлу pyproject.toml буде наступним:

        [tool.poetry]
        name = "solution"
        version = "0.1.0"
        description = ""
        authors = ["FirstName LastName <youremail@gmail.com>"]

        [tool.poetry.dependencies]
        python = "^3.9"

        [tool.poetry.dev-dependencies]
        pytest = "^5.2"

        [build-system]
        requires = ["poetry-core>=1.0.0"]
        build-backend = "poetry.core.masonry.api"

Формат файлу TOML. Розділ tool.poetry призначений для опису проекту: назва, версія, коротка інформація про проект 
тощо. Далі слідує tool.poetry.dependencies, саме тут вказані всі production залежності. Розділ 
tool.poetry.dev-dependencies призначений для залежностей, які використовуються під час розробки, наприклад pytest 
для тестів.


                        Ініціалізація вже існуючого проекту

​Щоб ініціалізувати poetry у вже готовому проекті, потрібно виконати команду:

            poetry init

Після цього буде запущено процес опитування щось на зразок зазначеного нижче:

            This command will guide you through creating your pyproject.toml config.

            Package name [test_poetry]:  
            Version [0.1.0]:  
            Description []:  
            Author [FirstName LastName <youremail@gmail.com>, n to skip]:  
            License []:  

            Would you like to define your main dependencies interactively? (yes/no) [yes]
            You can specify a package in the following forms:
            - A single name (requests)
            - A name and a constraint (requests@^2.23.0)
            - A git url (git+https://github.com/python-poetry/poetry.git)
            - A git url with a revision (git+https://github.com/python-poetry/poetry.git#develop)
            - A file path (../my-package/my-package.whl)
            - A directory (../my-package/)
            - A url (https://example.com/packages/my-package-0.1.0.tar.gz)

            Search for package to add (or leave blank to continue):

            Would you like to define your development dependencies interactively? (yes/no) [yes]
            Search for package to add (or leave blank to continue): 

            Generated file

            [tool.poetry]
            name = "test_poetry"
            version = "0.1.0"
            description = ""
            authors = ["FirstName LastName <youremail@gmail.com>"]

            [tool.poetry.dependencies]
            python = "3.10"

            [tool.poetry.dev-dependencies]

            [build-system]
            requires = ["poetry-core>=1.0.0"]
            build-backend = "poetry.core.masonry.api"


            Do you confirm generation? (yes/no) [yes]


Для активації віртуального середовища необхідно виконати команду:

            poetry shell

Але краще ініціалізувати проект через PyCharm, щоб у терміналі ми працювали у віртуальному середовищі автоматично.

CAUTION
Не забудьте вказати параметр Poetry executable, щоб PyCharm знав, де встановлено poetry.
"""