"""                                  Заняття 1: Development Tools



                        Менеджер пакетів та віртуальних середовищ pipenv

Pipenv — це сучасний інструмент для управління робочим середовищем у Python.

Основні можливості pipenv:
    - Створення та управління віртуальним середовищем.
    - Синхронізація пакетів у Pipfile під час встановлення та видалення пакетів.
    - Автоматичне підвантаження змінних середовища з файлу .env.

Коли на одному комп'ютері накопичується кілька віртуальних середовищ для різних проектів, над якими ведеться робота, 
неминуче виникає проблема управління набором віртуальних середовищ, підтримки в актуальному і робочому стані, 
видалення непотрібних для звільнення місця тощо. Ці завдання вирішує Pipenv за рахунок створення одного місця (папки) 
для зберігання всіх віртуальних середовищ, з якими ви працюєте.

Управління залежностями, коли ваш застосунок може перестати працювати через конфлікт версій встановлених бібліотек, 
— це одна з головних проблем розробників Python.

Використовувати requirements.txt, звичайно, можна, але вимагає додаткових зусиль для підтримки актуальних версій 
пакетів. Оновлення пакетів до нових версій може стати справжньою проблемою для застосунків, де багато залежностей.

Pipenv частково вирішує цю проблему, рекурсивно перевіряючи наявність конфліктів залежностей усіх пакетів і 
намагаючись встановити останні версії пакетів, які не викликають конфліктів.

Для розгортання застосунків на клієнтських комп'ютерах або серверах потрібно мати набір інструкцій для розгортання 
середовища, про яке ми знаємо, що воно працює. Зазвичай таке середовище — це середовище комп'ютера розробника, у 
якому ведеться розробка. Щоб повторити середовище на іншому комп'ютері, потрібно встановити ті самі версії бібліотек, 
Python і всі залежності. Це найпростіший та найінтуїтивніший спосіб уникнути конфлікту версій встановлених бібліотек. 
Pipenv вирішує цю проблему, генеруючи файл з точними версіями всіх бібліотек віртуального середовища та даючи 
можливість встановити з цього файлу "зліпок" працюючої системи.

Зараз Pipenv є фактично стандартом для розробників і вміти з ним працювати — просто необхідно.


                        Встановлення Pipenv

​Pipenv є пакетом Python, так само, як і pip, але не входить у стандартне постачання Python, і його потрібно 
встановлювати. Встановити можна за допомогою pip команди:

            pip install pipenv --user


                        Робота з віртуальними середовищем Pipenv

​Для створення середовища читає ім'я папки, в якій працює і увесь шлях до неї. Всі віртуальні середовища зберігаються 
в одному місці (залежить від ОС) і Pipenv автоматично створює нове середовище або використовує створене, залежно від 
папки, де ви працюєте.

Коли потрібно явно вказати, що ви працюєте в проекті, і потрібно створити для проекту середовище з конкретною 
версією Python, можна виконати команду:
            
            pipenv --python 3.7

Цією командою ми вказуємо, що у цьому проекті потрібно створити віртуальне середовище з Python версією 3.7.

Під капотом Pipenv використовує venv для створення віртуальних середовищ. Тому ви можете використовувати створене 
віртуальне середовище і без pipenv, якщо потрібно.

Якщо потрібно видалити середовище, можна скористатися командою:

            pipenv --rm
            
            
            
            
"""